In [24]:
import numpy as np 
import pandas as pd 
import seaborn as sns
import scipy.stats as sp

In [8]:
hp= pd.read_csv('Testing_Of_Hypothesis.csv')
hp

    Sr No S_Cust_id  Samsung Score Apple_Cust_id  Apple_Score
0       1   S336499             94       A336525           82
1       2    S73004             99        A73011           83
2       3    S79537             74        A79538           88
3       4   S769168             74       A769222           80
4       5   S609791             83       A609801           74
..    ...       ...            ...           ...          ...
95     96   S285617             77       A285629           87
96     97   S324135             85       A324151           82
97     98   S292076             83       A292091           88
98     99   S936528             82       A936566           91
99    100   S489010            100       A489031           95

[100 rows x 5 columns]

## Pre -processing of data

In [9]:
# rename the columns
hp.rename(columns= {'Sr No':'Sr_No','Samsung Score':'Samsung_Score','S_Cust_id':'Samsung_Cust_id'}, inplace= True)

In [10]:
hp.head()

   Sr_No Samsung_Cust_id  Samsung_Score Apple_Cust_id  Apple_Score
0      1         S336499             94       A336525           82
1      2          S73004             99        A73011           83
2      3          S79537             74        A79538           88
3      4         S769168             74       A769222           80
4      5         S609791             83       A609801           74

In [22]:
# check for missing and null
print("Null and Missing values:", hp.isnull().values.any(), hp.isna().values.any())

Null and Missing values: False False

### 1. The Samsung Average customer satisfaction score is minimum 75%.

In [23]:
'''
Let's assume that, 

H0 : Samsung Average customer satisfaction score = 75 % 

Ha: Samsung Average customer satisfaction score > 75 % 

Here, we are comparing sample average with hypothetical value (m), so we will use 'One Sample t-test/z-test'
'''

"\nLet's assume that, \n\nH0 : Samsung Average customer satisfaction score = 75 % \n\nHa: Samsung Average customer satisfaction score <> 75 % \n\nHere, we are comparing sample average with hypothetical value (m), so we will use 'One Sample t-test/z-test'\n"

In [27]:
sp.ttest_1samp(a= hp.Samsung_Score, popmean= 75)

Ttest_1sampResult(statistic=8.358287450922418, pvalue=4.0739777034636007e-13)

In [29]:
hp.Samsung_Score.mean()   # to cross check.

84.9

In [30]:
# conclusion: Here p value is very less , also |z| > 3, then we can say that with 99.7 % CI , we can reject our H0. 
# Hence, Samsung Average customer satisfaction score is more than 75% .

### 2. The overall average satisfaction score of Samsung is same as Apple. There is no significant difference in the satisfaction scores

In [31]:
'''
Let's assume that, 

H0 : Samsung Average customer satisfaction score = Apple Average customer satisfaction score

Ha: Samsung Average customer satisfaction score <> Apple Average customer satisfaction score

Here, we are comparing two numerical values, so we will use 'Correlation test'
'''

"\nLet's assume that, \n\nH0 : Samsung Average customer satisfaction score = Apple Average customer satisfaction score\n\nHa: Samsung Average customer satisfaction score <> Apple Average customer satisfaction score\n\nHere, we are comparing two numerical values, so we will use 'Correlation test'\n"

In [37]:
[hp.Samsung_Score.mean(),hp.Apple_Score.mean()]

[84.9, 87.81]

In [41]:
sp.stats.pearsonr(hp.Samsung_Score, hp.Apple_Score)

(-0.005216992494877171, 0.9589156571601546)

In [42]:
# As the z value is very less and also the p value is high, we can not reject our null hypothesis. Hence we can say that
# There is no significant difference in the satisfaction scores of Samsung and Apple.